УчетВУправляющихДляГит1/src/InformationRegisters/СтатусФизическихЛицКакНалогоплательщиковНДФЛ/СтатусФизическихЛицКакНалогоплательщиковНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусФизическихЛицКакНалогоплательщиковНДФЛ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьУдалитьСтатус</name>
    <type>
      <types>EnumRef.УдалитьСтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатус</name>
    <type>
      <types>CatalogRef.УдалитьСтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный/СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>РезидентРФНаКонецМесяца</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяСтавкаПункта1Статьи224НК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезидентРФНаКонецКвартала1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезидентРФНаКонецКвартала2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезидентРФНаКонецКвартала3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезидентРФНаКонецГода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусНаКонецКвартала1</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>СтатусНаКонецКвартала2</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>СтатусНаКонецКвартала3</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>СтатусНаКонецГода</name>
    <type>
      <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусФизическихЛицКакНалогоплательщиковНДФЛ/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		СтатусРезидент = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент");
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			ЗаписьНабора.Статус = СтатусРезидент;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = Неопределено;
	Если ЭтотОбъект.Отбор.ФизическоеЛицо.Использование Тогда
		ФизическоеЛицо = ЭтотОбъект.Отбор.ФизическоеЛицо.Значение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.ЗаполнитьВторичныеДанные(ФизическоеЛицо);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
